tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"

# Unix-y
brew "exa"
brew "sqlite"
brew "mas"
brew "zsh"
brew "thoughtbot/formulae/rcm"

# Dev tools
brew "cloc"
brew "git"
brew "neovim"
brew "ripgrep"
brew "watchman"

# IDEs
brew "rubymine"
brew "clion"
brew "goland"

# Langs
brew "deno"
brew "go"
brew "libyaml"
brew "openssl@3"

# Fonts
brew "font-jetbrains-mono"
brew "font-victor-mono"
brew "font-inconsolata"
brew "font-fira-code"
brew "font-input"

# macOS apps
brew "1password"
brew "acorn"
brew "backblaze"
brew "dash"
brew "fantastical"
brew "figma"
brew "firefox"
brew "paw"
brew "quitter"
brew "raycast"
brew "rocket"

# App Store
mas "Airmail", id: 918858936
mas "Bear", id: 1091189122
mas "BreakTime", id: 427475982
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Deckset", id: 847496013
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "Hush", id: 1544743900
mas "iA Writer Classic", id: 439623248
mas "iMovie", id: 408981434
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "koala", id: 1479881366
mas "Marked", id: 448925439
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Twitterrific", id: 1289378661
mas "Ulysses", id: 1225570693
mas "Vimari", id: 1480933944
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835
