tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Unix-y
brew "sqlite"
brew "mas"

# Writing tools
cask "obsidian"
cask "marsedit"
cask "microblog"
cask "fantastical"
cask "cardhop"

# Workflow
cask "raycast"
cask "hyperkey"
cask "rectangle-pro"
cask "cleanshot"

# IDEs & such
cask "rubymine"
cask "dash"
# cask "webstorm"
# cask "goland"

# Langs
# brew "deno"
# brew "go"
# brew "rust"
# brew "libyaml"
# brew "openssl@3"

# Dev tools
brew "cloc"
brew "ripgrep"

# Fonts
cask "font-jetbrains-mono"
cask "font-victor-mono"
cask "font-inconsolata"
cask "font-fira-code"
cask "font-input"
cask "font-inter"

# macOS apps
cask "acorn"
cask "backblaze"
cask "firefox"
cask "readwise-ibooks"
cask "stats"

# App Store
mas "1Blocker", id: 1365531024
mas "Day One", id: 1055511498
mas "Deckset", id: 847496013
mas "Developer", id: 640199958
mas "Hush", id: 1544743900
mas "Ivory", id: 6444602274
mas "Muse", id: 1501563902
# mas "koala", id: 1479881366
# mas "Marked", id: 448925439
mas "Paw", id: 584653203
mas "Reeder", id: 1529448980
mas "Save to Reader", id: 1640236961
mas "Tweaks for Twitter", id: 1567751529
mas "Things", id: 904280696
mas "Ulysses", id: 1225570693
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835
