# Unix-y
brew "mas"

# Blogging tools
cask "marsedit"
cask "microblog"

# Productivity
cask "fantastical"
cask "cardhop"

# Workflow
cask "raycast"
# cask "superkey"
# cask "rectangle-pro"
# cask "cleanshot"
# cask "leader-key"

# Dev tools
brew "cloc"
brew "ripgrep"
brew "mise"

# Terminals & Editors
cask "ghostty"
cask "zed"

# Communication
cask "slack"
cask "discord"

# Design
# cask "figma"
# cask "omnigraffle"

# Fonts
cask "font-jetbrains-mono"
cask "font-victor-mono"
cask "font-inconsolata"
cask "font-fira-code"
cask "font-input"
cask "font-inter"

# Utilities & Tools
cask "acorn"
cask "readwise-ibooks"
# cask "dash"

# App Store
mas "Actions", id: 1586435171
mas "Albums", id: 1469948986
mas "Bear", id: 1091189122
# mas "Blankie", id: 6740096581
mas "Byword", id: 420212497
mas "Copilot", id: 1447330651
# mas "Croissant", id: 6670288979
mas "DaisyDisk", id: 411643860
mas "Darkroom", id: 953286746
mas "Day One", id: 1055511498
# mas "Deckset", id: 847496013
mas "Developer", id: 640199958
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
# mas "Keynote", id: 409183694
# mas "Kindle", id: 302584613
mas "Linea Link", id: 1233368267
# mas "Model D", id: 1339418001
# mas "Muse", id: 1501563902
# mas "N₁₀", id: 6446053304
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Raycast Companion", id: 6738274497
mas "Save to Reader", id: 1640236961
mas "Slack", id: 803453959
# mas "StopTheMadness Pro", id: 6471380298
# mas "Tailscale", id: 1475387142
mas "Tapestry", id: 6448078074
mas "Tapestry Loom", id: 6578414736
mas "Things", id: 904280696
# mas "Ulysses", id: 1225570693
mas "Xcode", id: 497799835
# mas "koala", id: 1479881366
# mas "Paw", id: 584653203

# Manual downloads / Installed via other methods
# The following apps are installed but not managed by this Brewfile:
#
# Available but not auto-installable:
# - PyCharm, RustRover, WebStorm (Installed via JetBrains Toolbox)
# - Bluesky (https://bsky.app - desktop app not in Homebrew yet)
# - iA Writer (MAS: 775737172 - available but not in Brewfile)
# - Callsheet (MAS: 1672356376 - available but not in Brewfile)
#
# Manual downloads / External sources:
# - Ableton Live 12 Lite (Bundled with audio hardware)
# - SiriusXM (https://www.siriusxm.com)
# - Build (Xcode project directory)
# - Cyd (Unknown source)
# - Reader (Unknown source - may be web app)
# - NetNewsWire (Currently manual, but available as cask: netnewswire)
#
# SetApp downloads?
